package com.story.storyadmin.designPrinciples.openClosedPrinciple;

/**
 * @author: lipan
 * @date: 2021/8/19
 * @description:
 */
public class Demo {

    /**
     * 开闭原则（Open Closed Principle，OCP）由勃兰特·梅耶提出，他在 1988 年的著作《面向对象软件构造》中提出：
     *
     * 软件实体应当对扩展开放，对修改关闭
     *
     * 这就是开闭原则的经典定义。
     *
     * 在现实生活中，开闭原则也有体现。比如，很多互联网公司都实行弹性制作息时间，规定每天工作8小时。意思就是，对于每天工作8小时这个规定是关闭的，但是什么时候来、什么时候走是开放的。早来早走，晚来晚走。
     *
     * 作用
     * 开闭原则是面向对象程序设计的终极目标，它使软件实体拥有一定的适应性和灵活性的同时具备稳定性和延续性。具体来说，其作用如下。
     *
     * 对软件测试的影响：软件遵守开闭原则的话，软件测试时只需要对扩展的代码进行测试就可以了，因为原有的测试代码仍然能够正常运行。
     * 可以提高代码的可复用性：粒度越小，被复用的可能性就越大；在面向对象的程序设计中，根据原子和抽象编程可以提高代码的可复用性。
     * 可以提高软件的可维护性：遵守开闭原则的软件，其稳定性高和延续性强，从而易于扩展和维护。
     */
}
